<?php
/**Задание 4
Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Написать функцию транслитерации строк.
*/
$arr = [
  'а' => 'a',
  'б' => 'b',
  'в' => 'v',
  'г' => 'g',
  'д' => 'd',
  'е' => 'e',
  'ё' => 'e',
  'ж' => 'zh',
  'з' => 'z',
  'и' => 'i',
  'й' => 'y',
  'к' => 'k',
  'л' => 'l',
  'м' => 'm',
  'н' => 'n',
  'о' => 'o',
  'п' => 'p',
  'р' => 'r',
  'с' => 's',
  'т' => 't',
  'у' => 'u',
  'ф' => 'f',
  'х' => 'h',
  'ц' => 'c',
  'ч' => 'ch',
  'ш' => 'sh',
  'щ' => 'shch',
  'ъ' => '',
  'ы' => 'y',
  'ь' => '',
  'э' => 'e',
  'ю' => 'yu',
  'я' => 'ya',
  ' ' => ' ',
  'А' => 'A',
  'Б' => 'B',
  'В' => 'V',
  'Г' => 'G',
  'Д' => 'D',
  'Е' => 'E',
  'Ё' => 'E',
  'Ж' => 'Zh',
  'З' => 'Z',
  'И' => 'I',
  'Й' => 'Y',
  'К' => 'K',
  'Л' => 'L',
  'М' => 'M',
  'Н' => 'N',
  'О' => 'O',
  'П' => 'P',
  'Р' => 'R',
  'С' => 'S',
  'Т' => 'T',
  'У' => 'U',
  'Ф' => 'F',
  'Х' => 'H',
  'Ц' => 'C',
  'Ч' => 'Ch',
  'Ш' => 'Sh',
  'Щ' => 'Shch',
  'Ъ' => '',
  'Ы' => 'Y',
  'Ь' => '',
  'Э' => 'E',
  'Ю' => 'Yu',
  'Я' => 'Ya',
  ',' => ',',
  '.'=> '.',
  '!' => '!',
  ];
function transliterate(string $str, $arr): string{
  $newStr = mb_str_split($str);
  
  $result = "";
  for($i = 0; $i < count($newStr); $i++){
    if(array_key_exists($newStr[$i], $arr)){
       $result .= $arr[$newStr[$i]];
    }
   
  }
  return $result;
}
echo transliterate("Привет Мир!", $arr);

// docker run --rm -v ${pwd}/php-cli/code/:/cli php:8.2-cli php /cli/task4.php