<?php
/**Задание 3
Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким: Московская область: Москва, Зеленоград, Клин Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт Рязанская область … (названия городов можно найти на maps.yandex.ru).
*/
$arr = [
  'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
  'Ленинградская область' => [ 'Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
  'Рязанская область' => ['Рязань','Касимов','Михайлов','Новомичуринск']
];
foreach($arr as $key => $value){
  echo $key . ': ';
  foreach($value as $city){
    echo $city . ', ';
  }
  echo "\n";
}


 // docker run --rm -v ${pwd}/php-cli/code/:/cli php:8.2-cli php /cli/task3.php